[
    {
        "author": "Nugg",
        "rating": "5.0",
        "title": "Very nice chair",
        "content": "\nArrival:Product arrived in perfect condition.Assembly:The only assembly needed was to bolt the back of the chair onto the base of the chair using 4 very sturdy bolts.  Unlike other office chairs the bolts screw in from the back, not the sides which helps to give the chair a very solid feeling when sitting in it.  The lumbar support was already in place and just needed to be adjusted to my liking after assembly.Adjustment:The chair has a variety of adjustments available.  Two of them are for limiting the chair's movement when leaning back or forward.  This has come in handy a few times but mostly I tend to let the chair have full movement which helps it to support me while I adjust position throughout the day.  One of the other adjustments is height.  The height adjustment pneumatic seems a little bit more sturdy than other chairs I've had so I hope it lasts longer as that's usually the thing that goes out first.  The last adjustment is the tension control.  This is probably the most important adjustment.  When you first get the chair it's action is very 'loose' and you need to adjust the tension enough to support you without being too tense.  It took a couple days of adjusting this slightly to get it to a point that feels good and gives me just enough support without having too much.  After getting this adjusted correctly the chair was much more comfortable than when I took it out of the box.  There are videos on the company web site that show you how to adjust everything and what it does.Quality:The chair is very high quality.  The only thing that even slightly annoys me is that the arm rests can be bumped which then causes them to move from side to side.  I would prefer if that was something that could be set and then held in place a little more rigidly.  The mesh seat and back is very comfortable and adjusts to your body.  I'm 6 foot tall and 220 pounds and the chair supports me perfectly.  The plastic frame is a very sturdy plastic that does not warp or bend in any way even during intense sessions of on-line gaming where I tend to move around a bit.Over all:I used to slump in my chairs with my bottom out toward the edge and my back curved.  This would cause me some pain and discomfort throughout the day.  This chair helps me be comfortable while sitting in it properly which has helped my back immensely.  Combine that with the long period of customer support and this chair is worth the money.\n",
        "date": "September 30, 2011",
        "verified": true,
        "helpful": "16",
        "image_urls": []
    },
    {
        "author": "Shivaman",
        "rating": "1.0",
        "title": "HONEST REVIEW – PLEASE READ!",
        "content": "\nI have owned Herman Miller Classic Aeron chairs for decades and am quite familiar with how they function and what to expect – it is a wonderful product!THE PURCHASE:While making seating adjustments to my new Herman Miller chair from InscapeModern, I heard mechanical noises coming from under the seat, this is not normal and I began to sense the chair, which was sold as new, might be second hand, defective and possibly unsafe.The fashion with which this chair was packaged was far from professional. Two casters were busting out of the undersized cardboard box - if I had been present when the package was delivered, I would never have accepted it. Also, due to insufficient packaging around the chair itself, cardboard burns (cardboard rubbing up against the product during shipping) were noticeable. At this point, I was very disappointed with product, packaging, and shipping. Keep in mind, this is not an Office Depot, run of the mill office chair, this is a Herman Miller worth $800!I requested a full refund.InscapeModern was willing to offer me technical assistance and $50 compensation – really! InscapeModern also offered a refund if they found the chair undamaged by me. Did they not read the aforementioned?THE RETURN PROCESS:12/5/23: I returned the chair in the same box and same packaging as I received it. Note: I live in a condo complex with a common delivery area for packages. I could not leave the item in the common area for random FedEx pickup, as you never know if a thief might be lurking about, especially during the Christmas season. So, I located a dolly and strolled the package several blocks for drop-off at the local Postal Annex. BTW, I do not own a vehicle that could transport an item of that size.12/7/23: I receive a notice that FedEx is returning the chair back to me. Yes, after all that, the chair is on its way back to me - nothing I can do at this point. Imagine my surprise when I open the box only to find a completely different chair, a chair of much less value.  Wait, it gets better!A few days later, I am back in the delivery area searching through new packages and come across a box with my name on it. InscapeModern had returned my original chair! NOW I POSSESS 2 UNWANTED CHAIRS!12/13/23: After going back and forth with InscapeModern, their shipping department sends me 2 return labels with the information that FedEx will pick up both chairs by end of day, Friday the 15th.12/15/23: With high expectation of finalizing this debacle, I sat around all day waiting for the pick-up that may be as late as 10PM. FedEx never showed.12/16/23: Next day, InscapeModern sends me a message stating that “FedEx did not come to their facility yesterday and will try to come today or possibly Monday for pick up.” WHAT DOES THAT EVEN MEAN!?  Why would FedEx need to go to their facility to be notified of a scheduled pickup in San Diego? This whole thing is beginning to smell of either scam or idiocy.12/18/23: Boxes scheduled for the 20th were picked up on the 18th. Glad someone was home.Note: InscapeModern shipping never once asked which days I might be available for a Fed Ex pick-up. Did it never occur to the InscapeModern shipping dept. that people have to work and might not be available?I know this review is lengthy, but it is honest and true, and worth the time it took to write it. I simply want to caution anyone else from undergoing the awful experience I had with InscapeModern.In the end, InscapeModern did give me the full refund.Thanks for reading.\n",
        "date": "December 26, 2023",
        "verified": true,
        "helpful": "21",
        "image_urls": []
    },
    {
        "author": "tbearsf",
        "rating": "5.0",
        "title": "Well worth the price!",
        "content": "\nI'm a firm believer in the old saying \"you get what you pay for.\"  I'm sure there are plenty of exceptions out there, but for the most part, you can't expect to get top quality, top comfort, and top notch warranties at a bargain basement price.For less than $900, the Aeron chair I bought is far from the most expensive office chair out there, but few would call it cheap.  Still, this IS a bargain.  It comes with the Herman Miller 10+ year warranty, it's made of very high quality, durable materials, and it looks great.At 6'1\", 270#, I'm not a small guy (a bit of a bear actually :).  The size C is plenty large, however, and the whole chair feels rock solid even under my weight.  I upgraded to the Wave fabric and am quite glad I did.  I have the percale on my Aeron at work, and while it's comfortable, it seems a bit too firm at times.  The wave fabric is both supportive and a bit more flexible.  It seems to form to the shape of my body more than the percale.  It's also supposed to be a bit more durable.All of that said, a $200 OfficeMax chair may be better for you if the Aeron isn't comfortable for you.  The most expensive furniture, or any product, is worthless if it isn't right for you.  SIT IN THE CHAIR BEFORE YOU BUY!  I'm always surprised by the reviews claiming a chair is \"a rip off\" or \"not worth it\" because it turns out to be uncomfortable.  Is a shoe a rip off because it doesn't fit your foot properly?  Of course not, it's just not right for your body.  The same goes for chairs, particularly ones you may be using 10 or 12 hours a day.  Find a local retailer and sit in one of these before you spend $900 on it folks.  Some of you will find it as perfect and delightful as I do.  Others will find the chair doesn't fit right or feel right.I hope at least some of you find this helpful.  I really like the chair and would recommend it to anyone.\n",
        "date": "July 30, 2011",
        "verified": true,
        "helpful": "88",
        "image_urls": []
    },
    {
        "author": "Thail",
        "rating": "5.0",
        "title": "TLDR: Very comfortable, solid construction works great on carpeted floors.",
        "content": "\nReviewing the Aeron Chair by Herman MillerDuration of ownership - 1 MonthTLDR: Very comfortable, solid construction works great on carpeted floors.I've gone through several computer chairs over the years, most of which use the arms of the chair to secure the backrest.  This can be problematic, as I've run into many times, the arms break or become loose and the back of the chair becomes unstable.  This tends to end up in a downward spiral with a broken chair.  The other issue I run into is with the base of the chair, many are made of plastic and as you roll on the carpet the plastic holding the wheels together tends to give out.  Both situations have ended with me on the floor looking up at my computer desk.The Aeron chair is one I've had the pleasure of testing in the office many times in the past, however the price always kept me from buying one.  Well no longer!  I finally decided that I would spend the money up front rather than going through cheep chairs bought from the likes of Staples Best Buy and Office Space...Assembly was a matter of attaching 4 bolts, couldn't have been easier!Overall it has been glorious!  The mesh seat (or Butt Hammock as I like to call it) never gets uncomfortable and doesn't get hot after a while like leather. The adjustable arms let me quickly move them from in use to out of the way, the metal base and wheels roll over the carpet with ease.If I had any complaints it would be that I didn't buy one sooner.One Tip: The front of the seat has a rubber pad and a hard plastic lip.  If the chair isn't configured right this can be most uncomfortable.  In fact of those that tried my chair that's what they have complained about.  However a quick adjustment or two later that complaint went away.  The trick is to ensure that the seat is set so your thighs are parallel to the floor while at rest (using the height adjustment and the front angle adjustment) and that the seat isn't too far forward.I don't expect my review to change as I've used this chair type at work for many years and had no problems.\n",
        "date": "February 1, 2015",
        "verified": true,
        "helpful": "6",
        "image_urls": []
    },
    {
        "author": "KayPW",
        "rating": "5.0",
        "title": "What a bargain!",
        "content": "\nI received this chair today within the estimated range of delivery dates. It came in a large box which fit through the front door but was on the heavy side and too large for me to pick up myself. The chair in two pieces -- the back was wrapped in plastic separate from the seat and base. Directions for how to adjust the chair were attached to the base along with an allen wrench. Both pieces were wrapped in heavy duty bubble wrap. It took me 10 minutes max to open the box, use the allen wrench to remove the 4 large screws in the back of the base and attach the chair back. The directions for how to adjust the chair were very straightforward and easy to understand. As this chair isn't classified as \"new\" I made a note of anything that appeared worn. There are what appear to be strapping marks across both arms and because there was no strapping in the packaging, I can only assume this may have been from previous packaging. Please see included photos. Also, bear in mind the reflection is making the marks stand out. Minus the bright light, they're unnoticeable. No matter. The chair is fabulous, works perfectly and feels SO much better than what I have been accustomed to. What a deal!\n",
        "date": "March 10, 2017",
        "verified": true,
        "helpful": "23",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/716LWwRZOJL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/718fCdv3L2L._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/719+q3bGAAL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71GvQgtmPkL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71jWtWPKcEL._SY88.jpg"
        ]
    },
    {
        "author": "Anthony",
        "rating": "1.0",
        "title": "Horrifically disfigured and unusable chair, no quality control at all.",
        "content": "\nThis \"like new\" chair came extremely damaged, and it was shipped in this state it was not damaged on-route.The large screw that attaches the seat to the rest was completely stripped out with deep gouges in the plastic. Although not the most appalling issue, I put it first because this one renders the chair unusable even as a regular chair.The underside was scratched, gouged, and even sheared. There are actual chunks missing from the plastic as if someone took a power tool to it.The gouge lines also travel through the padding under the seat, which is gashed and sheds foam everywhere when touched.The plastic housing that holds the mechanical internals is deformed with cuts that go all the way through the plastic. It is so deformed that the top and bottom pieces do not even fit together, impossible to miss visually.The very bottom of the center post is missing a cap, so it got grease on my carpet.The levers that adjust the chair do not function.IT DOES NOT HAVE THE PROMISED WARRANTY STICKER.The back is \"like-new\", they obviously took a completely totaled chair that had been attacked with power tools, threw a a used back on it, and called it good.\n",
        "date": "August 16, 2019",
        "verified": true,
        "helpful": "7",
        "image_urls": []
    },
    {
        "author": "E.T. Hangermain",
        "rating": "4.0",
        "title": "sturdy and comfortable",
        "content": "\nI needed a chair that was sturdy enough to hold me (I'm 275 pounds), last a long time, adjustable and not too warm.  This was all of those and it has been a great choice.  I figure I spend about 300 dollars every few years on a new office chair.  This has a 10 year warranty (I think it's 10?) and seems like it will last that long.Easy to assemble too, because it is almost totally assembled when it arrives, you just put the seat on the legs.\n",
        "date": "August 16, 2013",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "J. Clark",
        "rating": "5.0",
        "title": "This chair is worth the price",
        "content": "\nI am fortunate enough to work from home, and I have tried a variety of chairs. This one blows them all away, and I'm only left to wonder why I waited so long. I bought mine from Amazon Warehouse, a refurbished chair. There was a small mark/scratch on the left arm rest, but other than that, the chair looked and smelled new. It came in two pieces, with 4-6 bolts and a hex key. No instructions were included at all, perhaps this is because it wasn't a brand new chair. I didn't have any issues, though, and had the chair assembled in about 15 minutes.I did download the adjustment instructions directly from the Herman Miller website, although before I did that, I played around and found a comfortable adjustment. I did look over the instructions just in case I was missing anything.The chair is so comfortable! My favorite part is when you go to stand, the chair helps lift you out and stays in an upright position until you sit down. So if you walked in and looked at the chair, you'd think it might be uncomfortably rigid, as it sits upright more than you'd imagine. But once you sit down, it yields and is far superior to any other office chair (at least that I've ever used/owned.)It is very easy to adjust, very easy to assemble, and is extremely comfortable. The only downside is the price, but everyone looking at a Herman Miller chair knows about its price going in.I would highly recommend this chair!\n",
        "date": "February 27, 2012",
        "verified": true,
        "helpful": "3",
        "image_urls": []
    },
    {
        "author": "loowood2 on YT",
        "rating": "5.0",
        "title": "Finally a task chair the doesn't hurt. At 1/2 ...",
        "content": "\nFinally a task chair the doesn't hurt. At 1/2 price, be sure to order the Opttico Office Chair Caster Wheels Replacement Set of 5 - Black 3\" HARDWOOD FLOOR Chair Wheels - No Chair Mat Needed - Roller Blade Style HEAVY DUTY Desk Chair Casters With Soft Rubber Wheels, Smooth & Silent to really make this chair right. IMHO These seem like a good deal, 1/2 off retail. Now months later I realize that these chairs or at least the one the grabbed and sent to me is worn out just to the brink of being noticeable. Finally the latch to raise and lower the hydraulic cylinder, the little special plastic part of the chair snapped off. This symptom was every time I came back to the chair it had risen to the top of it's height and would not hold the sitting height I last set it at. After watching many how to adjust and then trouble shoot and repair these chairs I found how and where to buy the pre ready kit, cause they know it's weak. So add another 60 bucks and you have to practically take the whole chair apart to fix a weak plastic part that is held in with one tiny screw. So needless to say after 500 bucks I am back in my $99 Amazon office chair that both arms can be moved out of the way for tasks. When I can afford to buy the parts and then dig in and repair / replace it I might have my HM chair back at my desk again. If you are going to buy one of these used, try to go and inspect it. These chairs come in 2 parts in a 50lb box no assembly require so DO NOT PAY FOR ASSEMBLY! My cat could do it. If you live in any major city search these out at office furniture resale outlets, they have hundreds of them and with a little kindness perhaps they would help you pick out one that doesn't have one of the 1/2 dozen major over use issues. I live 1.5 hrs going 80 mph from Sacramento, Ca so it would take a day to do it right. They got me. I love Amazon but every once in a while things get squirrelly. This is one of them and it isn't inexpensive in any way. Also these are a major dust magnet and have many nooks and crannies that are near impossible to get to. Take it out in the drive way and use a leaf blower to start, seriously, then dust off and brushes and do it about every 60 days, just like a computer keyboard.\n",
        "date": "August 1, 2017",
        "verified": true,
        "helpful": "3",
        "image_urls": []
    },
    {
        "author": "Matthew Glinski",
        "rating": "5.0",
        "title": "As close to chair perfection as you can get for under $1000",
        "content": "\nI work as a computer programmer for a living. That means I get to sit in front of a computer at least 8-9 hours a day, sometimes more then 24 hours straight if I have deadlines to meet. I am also a large person, 270+ lbs. No other chair I have ever owned has felt right for me. Most chairs I have used have broken 7-8 months after purchase. Either the main support system cracks, the armrests break off from the back of the chair, or the gas piston falls through the base of the chair when I accidentally sit down on it to fast after 8+ hours of solid work and just one break. This chair is completely different then any other chair I have owned. The base is solid metal, so no breakage possible there. The arms are attached to the structural base of the chair, not the back, and they are independent of the structural integrity of the chair as a whole. The back is attached to the base with oversized hex screws that feel more solid then some welding work I have seen. What little plastic is on the chair is the most rigid I have ever seen, it seems stronger than ABS plastic. The best part however is the actual chair \"cushions\". The material is less than 3mm thick and it's a mesh weave not an actual cushion, but it feels better than 6 inches of memory foam. Not to mention the seating area is suspended above the structural base like a truck is suspended above it's tires. This is as much of a work of art as it is mechanical marvel. Nothing else even comes close. Is it worth $880? That depends on how much you value your comfort while working and how often you want to replace your chair if you are prone to breaking them for whatever reason. With a 100% 12 year, 3 shift warranty (described as three 8 hour shifts -back to back- per day, totaling 24 hours a day of use), I will actually save $1500 in the next 12 years on replacing subpar chairs alone. These chairs hold their value over time too, most used Aeron chairs go for $450-$500 even after 8+ years of use. To me it's a no brainer. I demand the best quality for and out of my work. That means I also demand the best tools to get the job done and keep my competitive edge. If you are a professional that sits at a desk all day, the Aeron chair is seating nirvana.\n",
        "date": "December 29, 2011",
        "verified": true,
        "helpful": "17",
        "image_urls": []
    },
    {
        "author": "Kurt Guntheroth",
        "rating": "5.0",
        "title": "God's Own Chair",
        "content": "\nThe Aeron chair is supposed to be the state of the art in seating, It is. It's why people would pay $950+ for a desk chair when Amazon Basics sells a similar-looking one for $130. I bought this chair because (1) my old chair, which was surplus'd from a previous employer 20 years ago, was falling to bits, (2) because I'd set in Aeron chairs at work and they were comfortable, and (3) I'd hurt my lower back, and my old chair was making it worse.I bought the C size, because I'm 6'2\" and 240lbs. It is wide enough, but not too wide. I like the lumbar support. The chairs I used at work didn't have 'em. I also like the ability to tilt the front of the chair down when you need to sit forward at your desk, like for building things. You can buy Aeron-branded chairs for $75 less if you give up all the adjustability, but if you're going to cheap out, might as well buy the Amazon Basics chair.Even the unboxing experience was ergonomic. Remove the shipping straps. Pull the top off. Pull the sides straight up. No lifting. You have only to assemble the back onto the chair with four big bolts. An Allen key is included. The unboxing and assembly went very smoothly and took less than 5 minutes. There's no way to make a mistake. A chimp could do it. Ooh Ooooh!The armrests swivel in and out, whether you want them to or not. This is just a bit annoying, and might trigger your OCD if you want them to stay. The frame of the chair is molded. The mold left sharp edges where halves of the frame join. There are also sharp edges around the screws that hold the frame together. I can probably sand the sharp edges off. These are pretty minor complaints.\n",
        "date": "November 17, 2016",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Sung Choi",
        "rating": "4.0",
        "title": "It's definitely got it's quirks",
        "content": "\nNot as good as a Herman Miller original. Of course, if you were buying this, then you already know that.It's got a weaker structural integrity than the original product and definitely \"squeaks\" when tilted back. I would say, at this price point you're already willing to throw 700 bucks on the board, just eat the cost and buy a brand new one from Herman Miller. I'm not going to make any assumptions about 6 months down the line, but I have my skepticism on my overall happiness with the product vs if I had just gone to Herman Miller.\n",
        "date": "November 18, 2022",
        "verified": true,
        "helpful": "5",
        "image_urls": []
    },
    {
        "author": "Renee P.",
        "rating": "3.0",
        "title": "Comfort",
        "content": "\nThe chair is very comfortable which is what I was looking for. However, I think this chair was a return or refurbished. The only instructions in the box were how to replace the back of the chair. No information on how to adjust the chair. I ended up online to see how to adjust the chair. No warranty info in the box either.The chair is comfortable but I am disappointed that I paid this much money for a chair that that was a return.\n",
        "date": "April 23, 2023",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Michael A Yates",
        "rating": "5.0",
        "title": "It's all good",
        "content": "\nI was hesitant to purchase a nearly $1,000 chair online without the opportunity to test it first.  And the Herman Miller Aeron chairs I sat in at client sites never blew me away.  They always felt to small.  After doing some research I discovered that Herman Miller makes three different sizes of chair A=small, B=intermediate, and C=Large.  So based upon all the positive buzz around this chair, and advice provided by my chiropractor, I took a chance and bought the biggest size (C) - I am 6'1\" and 210.  I made a good decision.It is not the type of chair that you sit in and go aaahh. Not plushy, and soft, and oversized.  But after sitting in it for 2-3 days, up to 8-10 hours a day, I noticed that my back was not stiff, my legs not stiff and crampy.  I also purchased the aftermarket headrest on Amazon (not a Herman Miller product, but still great quality) and that made the chair even better.  It is incredibly comfortable and highly adjustable (spend the extra dollars and purchase the fully loaded Aeron chair so you get all the adjustment options).  I saved big by purchasing the chair on Amazon as compared to other retailers who charge up to twice as much.  Plus you get the full 12 year warranty from Herman Miller.  I found it about $100 cheaper from an online retailer, but it only had a 30 day warranty.I have been seeing a chiropractor for the last 10 years to straighten me out from nearly 20 years of spinal abuse from playing football and rugby.  This chair has absolutely helped in this regard.  He noticed that I have been holding my adjustments better, and we both attribute it to the herman Miller Aeron chair.\n",
        "date": "May 16, 2011",
        "verified": true,
        "helpful": "8",
        "image_urls": []
    },
    {
        "author": "W. OConnor",
        "rating": "5.0",
        "title": "The best business chair",
        "content": "\nIf your hair is mostly gray, you remember the early eighties, and that this chair thundered on the scene as the power chair of all the big dogs, and expensive as a set of Mercedes hub caps. I am 6'4\" and 300 lbs. This chair is the largest Aeron and is the first ever that I could adjust to a seat height the really fits. Comfort, physical support, and overall customizability are unmatched. I bought it after weeks of on and off searching and finding reviews that made reference to another saying \"...chair X is good, of course of course it isn't a 'Hon'.\" Finally I checked a 'Hon' site and found reviews that said it \"...was a real good chair, but of course it was not a Aeron.\" And, as I said, I knew of Aeron - and that is was not $300 like so many other chairs I have prematurely sent to Goodwill in the last few decades. SO I decided, at last, to get one in a color to fit my den .My only complaint is that the lumbar adjustment device, partly because of its range of adjustment that you have to like, tends to ride up and out of its guide channels on each side; but is a simple a matter to put it back so I can forgive a minor annoyance. On the color I must note that this vendor did not deliver. The chair that arrived was stock gray, but Amazon made a more than fair price adjustment, so I am OK with it and just keep the light low - hey it IS a den.\n",
        "date": "February 11, 2014",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Kindle Customer",
        "rating": "5.0",
        "title": "Amazing",
        "content": "\nI had this Herman Miller Aeron Chair on my list for a couple of years just monitoring prices and feedback.  I finally purchased while it was on sale.  I'm very pleased.  It is a very nice chair.  The lack of a seat cushion was a little concerning from pictures, but, the netting system is very deceptively comfortable.  After spending most of the last 8 days in this Aeron chair, I have to confess I'm sorry I waited so long.  I replaced a 13 year old no-name chair from that Big Box store whose cushion failed 5 years ago.  And honestly after the sale price, the Aeron wasn't that much more expensive.  Others have seriously good advice about trying a chair before you buy it but if you're like me in the Midwest, NO one carries it locally.  With no hassle returns, it wasn't much of a risk for me to buy to try it.  The lumbar support on this chair is pretty nice.  I've not had a lumbar support before, but I'm impressed at how much longer I can sit comfortably and not have upper back pains.  I have no regrets buying this.  My singular niggle is simply the Recline lock that keeps the back from reclining on my chair seems to slip out occasionally.  This may be a QC issue and its very minor.  I seem to have to flip it back into position once or twice a day randomly.  If you're looking anywhere near this price range, you definitely owe it to your backside to give this chair a serious look.\n",
        "date": "December 24, 2012",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Michael Villaverde",
        "rating": "5.0",
        "title": "Durable, comfortable, flexible",
        "content": "\nI've been using my Aeron chair at home for just over a year, and at work for 3 years.  Many of the ~250 chairs at work are Aeron chairs, some in use nearly 24/7 by rotating shifts of essential personnel.  They handle constant use well, with few breakages (a few have a missing arm or some other fault).  Each chair comes with an excellent warranty, though I have no idea if my office utilizes it.I work in an enterprise IT environment, and spend much of my work day sitting.  Even at the end of a 12+ hour shift I'm not sore, sweaty, or particularly uncomfortable.  I fell at the edge of medium and large on the sizing chart, so I went with the large size.  The seat on the large is a little wider than I need, but the bit of extra length makes reclining very comfortable.The chair comes in several pieces, and is easy to assemble (no additional tools required).  Adjusting the overall height, arm height, or pressure required to lean back are simple.  I don't use the lumbar support, as I find it more comfortable without it.I ordered my Aeron chair through Backstore, who I communicated with regarding shipping (only option for receiving address was 2-4 week via USPS).  They responded quickly to my replies, and were very professional.  They also contacted me later to check if I had received the chair.  Were I to order additional office equipment offered via Backstore, I would definitely work with them again.\n",
        "date": "January 15, 2014",
        "verified": true,
        "helpful": "2",
        "image_urls": []
    },
    {
        "author": "Anonymity is nice",
        "rating": "5.0",
        "title": "Exactly the right chair",
        "content": "\nI have used the same Aeron at work for 8 years.  It has the two tilt/recline levers on the left and tension thingie and height adjuster on the right.  It has the adjustable arms.  I finally decided to spring for the same thing at home after 4 pillows on my third different office chair weren't enough to provide comfortable seating.After looking at all the Amazon offerings, we came to this one, and I got *exactly* the thing I wanted.  This one is black (I have like platinum or whatever at work: I don't care), and it has all the appropriate knobs and so forth.  It's the middle size (\"B\").  As an actual bonus, the padding on the arms is *nicer* than my work Aeron: it's squishier and less like shiny/hard foam.  It's used, so what.  I feel like I could sit in the one at work another 8 years if I cared to.Since no one ever takes the photos that let you see the dang thing, what we have here are photos of every piece of the thing, from assembly through to the lumbar doodad.Shipping was fine: I think it actually arrived early.  Assembly is trivial: insert the back and use the provided hex wrench to secure it.  Done.\n",
        "date": "May 1, 2018",
        "verified": true,
        "helpful": "14",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/71INljQt6sL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71Mlf5nupfL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71XE8pkN2XL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71dI9f-xUZL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71vTWJyJGmL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71yY0+IqCLL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71yzxDE+19L._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/815DHTkDuaL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/818HEwebAWL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81SJN63LNxL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81XkxQ+P6OL._SY88.jpg"
        ]
    },
    {
        "author": "Silverstar",
        "rating": "2.0",
        "title": "Beware who you order Herman Miller chairs from - the 10yr warranty may not be valid, you might be buying Herman Miller 'seconds'",
        "content": "\nDo not purchase from Madison.Seating!  They sell seconds and did not advertise as such.  The Herman Miller 10 year warranty is not supported when you buy your HM seats from Madison.Seating.  My seat bottom broke after less than two years, and now we have to pay Herman Miller more than $100 to replace it, since Madison.Seating will not help us at all.  They do not stand behind their products, nor did they advertise our Herman Miller chairs we purchased as seconds.  The many Aeron chairs we bought from Madison.Seating were actually substandard based on input from Herman Miller.  Herman Miller told us that we needed to deal directly with Madison.Seating, our supplier, since we did not order directly from Herman Miller or an official outlet.  HM told us that the chairs they sold to Madison.Seating were substandard, basically seconds, and they were rid of them by selling them to Madison.  (Actually, that was quite sneaky of HM to sell off seconds to a low class Amazon seller, as well!  Shame on you Herman Miller!)  So after spending thousands of dollars on at least 5 or 6 Aeron chairs from Madison.Seating, they won't help us at all with the broken seat.  If I had known that the 10yr warranty would not be backed, I would not have purchased these chairs from Madison.Seating.  Be aware of your Herman Miller purchases from other sellers that are not direct distributors of Herman Miller.  Read the seller's warranty in full.  If your chair arrives without a sticker on the bottom with codes for reference when you need to call and order parts for repair, you have a \"second\" on your hands.\n",
        "date": "August 23, 2017",
        "verified": true,
        "helpful": "6",
        "image_urls": []
    },
    {
        "author": "Bored W. Gadgets",
        "rating": "4.0",
        "title": "THE best chair--only smaller",
        "content": "\nAfter back surgery, I requested a better chair at work and they gave me a Herman Miller Aeron, size C.  I loved it.  So I looked for one on Amazon and found that I was going to have to shell out $1000, more or less, to park in one at home.  Then recently I saw that there were some open box versions for a lot less.  They were size B.  So I went to the Herman Miller site and did an evaluation using their sizing chart.  Based on height, I am basically within 2 of their colored squares.  Based on weight, I need a size C.  I decided to get the open box Aeron and use it as impetus to lose weight.  PEOPLE! DOES THAT EVER WORK?!  Fortunately, my wife likes my Herman Miiller size B, so as soon as I have this one paid off, I'll come back to do what I should have done to begin with: go for the size C.\n",
        "date": "October 23, 2017",
        "verified": true,
        "helpful": "3",
        "image_urls": []
    },
    {
        "author": "Richard P Adams",
        "rating": "5.0",
        "title": "Kicking chair and for this price I would highly recommend!",
        "content": "\nLove this chair! I have been through a lot of chairs that I use for my computer and this one is extremely comfortable. I got the \"open box\" and it is supposed to be \"loaded\" and is worth the full price and a steal at this price.  I actually went and saw one the was the 2017 model and this has a different type Lombard support so I am thinking that it is a previous model. Regardless, it has an up and down, up and down on the arm rests that also swivel, the Lombard support moves up and down, an adjustable force for leaning back, adjustable stop for back leaning (four to choose from) , a leaning forward stop adjustment. I think I covered them all. The price was stellar and just right for me and the warranty is to my liking.  Tired of buying crap chairs. Yes, they cost less but from the get go, this chair is very comfortable. The more I use it the more I like it.Note that the A, B, C have to do with the size of the chair. I am a short 5' 7\" male and the B size is just right for me. To put it together four allen screws that put the back on with the included allen wrench. That is it!\n",
        "date": "January 15, 2017",
        "verified": true,
        "helpful": "23",
        "image_urls": []
    },
    {
        "author": "R Jackson",
        "rating": "3.0",
        "title": "Careful - Not as advertised",
        "content": "\nBe careful when ordering this product from Madison Seating. When I ordered this product, the description included this \"With adjustable Posture Fit SL, individual pads support the sacrum and lumbar regions of the spine...\" and \"Ships fully assembled\". Neither was accurate as delivered. A different lumbar support mechanism was installed and the seat required assembling the back to the seat. The assembly wasn't a big deal, but I had made the decision to buy this chair over others  based on the \"Posture Fit\" feature. The chair, otherwise, was as described and delivered quickly and in good condition. I wrote Customer Service and received a prompt reply. Customer Service indicated that I should have known from the title and the pictures that the Posture Fit wasn't included. From my perspective, since Posture Fit is a lumbar support feature and the picture to me showed nothing specific about the lumbar feature, I humbly disagree. Had the description been accurate, matching what was delivered, I might still have purchased the chair. But my buying experience went from \"Awesome Value\" to \"Disappointing Experience\". Customer Service wrote \"We are sorry if the product page seemed confusing\". It didn't \"seem confusing\" to me; it was, in fact, not accurate.\n",
        "date": "May 3, 2018",
        "verified": true,
        "helpful": "9",
        "image_urls": []
    },
    {
        "author": "AK & AN",
        "rating": "5.0",
        "title": "Goodbye Back Pain!",
        "content": "\nAlright--so let's start with a few things.Price - The price is high, but if you sit down for more than 5 hours a day--I'd recommend one.  To my fellow Gaming PC builders--why spend 2k on a high end rig and then 100 bucks on a chair?  Invest in a good chair.Actually Buying It - Originally went to DWR and sat down in a bunch of these chairs to get a feel for em.  DWR helped me out by letting me test em so I decided to order through them.  It would take 3-4 weeks for me to get my chair--are you serious?  Nevertheless I still went with them--but after they missed a shipping deadline which would have delayed my order more--I cancelled my order as it hadn't shipped.  Ordered it on Amazon and had it within 2 days.Comfort - Already plenty of reviews explaining how to sit and use it--but here's my take--the chair itself--I can't even tell it's working.  I used to have backpain with my older chairs and they are a thing of the past.  The arm rests are good enough to where they don't wear down and hurt my elbows.  My one complaint is that when sitting indian style, the hard plastic material to the front of the chair hurts my feet.  Other than that--it's a solid chair. I'm studying for my MCAT right now and sit for 8-10 hours a day and feel no back pain.Cheers!\n",
        "date": "February 2, 2013",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Matthew Keefe",
        "rating": "5.0",
        "title": "Awesome chair, expense justified after a week",
        "content": "\nSince the beginning of my freelance career I wanted an Aeron chair but could never justify the cost. Well since then i've started my own company and was looking for an office chair that wouldn't interfere with long development hours. I can say without a doubt the Aeron chair has lived up to its name and history. The build quality, adjustability and materials are awesome. I've been able to sit for much longer during a day without leg and back pain. I opted for the highly adjustable version and am sure glad I did. The ability to fine tune the settings for the perfect fit is in actuality priceless.I realize the chair is most definitely pricey ($800+ for the decked out version) but if you work for a living sitting you owe your body a comfortable seat. Not to mention you'll be happier later on down the road as the chair will easily last 10+ years if taken care of properly. The cost will likely be spent over time on inferior chairs so look at the long term in this case. Don't blindly buy a size/model though, do your research on what would work best for your use case. You can even call Herman Miller and ask specifics based on weight, height, office style and a myriad of other specifics.I purchased mine here on Amazon through OfficeDesigns, highly recommend them as well.UPDATE: The chair is on a holiday sale, almost $100 off the already low price.\n",
        "date": "December 3, 2012",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Trista Menke",
        "rating": "5.0",
        "title": "Stands the test of time",
        "content": "\nI worked in a control room where the chairs are shared and sat in 24/7 all year, many times with tools in pockets, often rolling around the room, and being constantly adjusted as the next shift comes on. Lots of big guys sitting in them. I've seen many very expensive chairs come and go. Most more expensive than this. They had to buy new chairs every 6 months or so, and we were always trying something new. They probably should have more often than that, but they waited until the chairs were so broke no one would sit in them any more.For the 8 years I was there, we had three of these making the rounds. And they were there long before I was, and will probably be there for a long time to come. Two of them are as good as new, and the other could be fixed easily enough. They didn't buy more because some of the guys didn't like them since they're not plushy and don't have a head rest.I sat in a medium with lumbar support pad for 12 hours a day for years, and I love this chair. I used the tilt adjustment a ton - tilt forward to operate the equipment, tilt back to sit back and watch the control panels. Its comfortable for all kinds of tasks. I finally bought one for the house.\n",
        "date": "February 4, 2014",
        "verified": true,
        "helpful": "3",
        "image_urls": []
    },
    {
        "author": "smiley",
        "rating": "5.0",
        "title": "I don't see how my butt can live without it!",
        "content": "\nI purchased thiis lovely chair to be used at the desk in my home office.  I chose the brown color and to my surprise it turned out to be very subtlle and not as bright as the picture led me  to believe.  I also own  one in  black and it's beautiful too.(I've owned that for a little over 5 years - in perfect condition and used as the gamer chair.)It is the most comfortable office chair that I have ever owned.Everytime I  sit in it,  I marvel at the  sudden burden that is lifted off of my lower back, which makes it ideal if you plan on sitting for a few hours and getting a lot of work done.The lumbar support works wonders once it's adjusted to your individual need. Mine is  very low.Also, it was a good idea to purchase the large model because I  tend to fold my legs  (Ghandi style) when i'm  in deep thought or working on something important.  So it is has very ample room which I like.The only consideration is the price which concerned me  in the beginning but  I feel that this is something  that lasts a long time, is unbelievably comfortable and pays for itself with all of the work that I get done.\n",
        "date": "November 9, 2012",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Paul in Greenville",
        "rating": "3.0",
        "title": "Mixed bag",
        "content": "\nI was really looking forward to owning an Aeron chair.  Have to say I'm mildly disappointed.  The chair looks great and, for them most part feels great.  I'm sure it will last every bit as long as they say it will.  However, there's one real problem and one minor annoyance.The problem is the lumbar pad, which simply will not stay in place.  It rides up in the tracks, eventually coming off the top of them if I neglect to push it back down for a couple days.  Assumed it was defective, so I called Herman Miller.  They told me to contact the vendor, which I did and was sent a replacement.  However, the new one works no better than the original.  I'm 6' 1\", 220 lbs, so I don't think it's a case of me being too big for the C size Aeron.The minor annoyance is the arms.  They pivot horizontally at the back end, I suppose to accommodate larger or smaller people.  Problem is, while they have detents to hold them at several positions, they don't lock, so every time I go to get up, at least one of them swings outward.\n",
        "date": "August 11, 2012",
        "verified": true,
        "helpful": "19",
        "image_urls": []
    },
    {
        "author": "kittenmittens",
        "rating": "5.0",
        "title": "Brand New",
        "content": "\nI am in love with this chair. I started working from home and sitting in my old chair was fine for a few hours here and there but when I'm in it for hours on end working it causes me so much pain from the base of my spine all the way up to my skull. I didn't want to spend a lot of money but I have a friend who works for Herman Miller and said it would definitely be worth it and not to sacrifice my health or comfort something cheaper. With his recommendation and my budget in mind I came to this compromise. To me I got a brand new chair for much less than what would be considered a \"new\" purchase. It may be considered open box but you can't tell the difference. It was packaged well and easy to assemble. It feels like a dream when you sit in it. This is definitely a workhorse chair designed for long hours. It is supposed to be firm and supportive but its just incredibly comfortable to me. I've already tested it out by using it for 15 hours and I am absolutely not disappointed.\n",
        "date": "January 19, 2017",
        "verified": true,
        "helpful": "12",
        "image_urls": []
    },
    {
        "author": "Stevo!",
        "rating": "4.0",
        "title": "While it is nice to be able to adjust the height of the ...",
        "content": "\nI use two version of this chair.  The highly adjustable one I bought on Amazon I use at home, and I have another basic chair that I have at my office.  While it is nice to be able to adjust the height of the arms or move the armrests in and out, I don't really adjust anything else.  The basic chair meets all my needs.  If I had to do this all over again I probably would have gone for the basic chair and saved some coin.You can still adjust the arms on the basic chair with some effort, and lock the height into place.  I set my armrest heights once years ago on my basic chair and haven't changed them since.  Same goes for the highly adjustable one here.\n",
        "date": "June 2, 2015",
        "verified": true,
        "helpful": "3",
        "image_urls": []
    },
    {
        "author": "Amazon Customer",
        "rating": "5.0",
        "title": "Highly recommended for humans who sit often.",
        "content": "\nMy dad has used an Aeron chair daily for 18 years. The fact that he had used this chair for so long was a big influence on my purchase decision.I had been using what I thought was a fairly decent office chair for about 3 years before purchasing this one to replace it. Initially I was skeptical about purchasing a refurbished chair, but having had firsthand experience with the quality of Herman Miller chairs I decided to make the purchase. I am very pleased with this chair. The build quality is excellent, and I can't tell that it's been used or refurbished. It was very easy to assemble, four bolts to affix the back to the base (and the correct size hex key is included). The adjustments are fairly intuitive and I was quickly able to mold the chair into a comfortable seating position that adequately supports my lower back. The mesh material used for the seat and back is comfortable and durable. It's especially nice in hot weather: no more sweating or sticking to leather cushions.\n",
        "date": "October 24, 2017",
        "verified": true,
        "helpful": "4",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/71+LEIjOE2L._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81MXhw1XbdL._SY88.jpg"
        ]
    },
    {
        "author": "Joseph H. Monast",
        "rating": "4.0",
        "title": "Good, but not magic",
        "content": "\nThe Aeron chair is very good, everything it claims to be.  Don't expect magic, though.  It's very expensive; but I thought worth the cost if it could help me even a little deal with my back problem.  It hasn't.  The problem is not the chair, but my expectations.  I like the chair better than my previous desk chair; but, I'd not have made the $850 investment had I known it wouldn't make a difference with my back.The chair is good; but I'd recommend not bothering with the Lumbar Pad, which I found so unhelpful and even uncomfortable that I've removed it from my chair.  Regardless of how I adjusted it, it felt like a wooden pole across my back.Saying that, it's pretty cool to own an Aeron....\n",
        "date": "September 18, 2011",
        "verified": true,
        "helpful": "5",
        "image_urls": []
    },
    {
        "author": "Carl O",
        "rating": "3.0",
        "title": "Not suitable for sitting cross-legged",
        "content": "\nSummary: I normally sit cross-legged in my chair but because the edges of this seat are higher than the center (like a shallow cup), it is nearly impossible (and very painful) to sit in it that way. In retrospect I should have seen from the picture that this was likely. Sitting normally the chair is quite comfortable, and you could probably sit with one leg crossed under you. But if you like to cross both legs then DO NOT get this chair. I would give it 5 stars for normal sitters and 1 star for cross-leg sitters, which is why I put it down as a 3.One other thing I want to mention is the box it came in, which I would give -10 on a scale of 1-5. I certainly hope that this isn't the way HM ships these and it was just the reseller, because it was TERRIBLE. The \"box\" is put together with scraps of cardboard taped together. I really hope it survives the return shipment without falling apart.\n",
        "date": "April 27, 2014",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Josh",
        "rating": "5.0",
        "title": "Amazing Deal!",
        "content": "\nI had been mulling over buying one of these chairs for years. The price has always just been too high. I couldn't justify to myself, after I added all those features like adjustable armrest positions, and tilt, and stuff. It came out to nearly 1000 dollars on Herman Millers website. These guys had the fully loaded one ready to go for so much cheaper, I thought it was too good to be true. I read the one other review from these guys, worried that almost nobody has purchased this thing from them. I figured... I could always get my money back if it was a bust, so give it a try. I was no dissapointed! This arrived and was super simple to setup. Just had to screw the backrest into the seat, 4 screws, and it was ready for sitting. It's in perfect condition, works amazingly well, even has the leather armrests which is very fancy. Buy this chair, you won't regret it, I work at a computer for 8-12 hours a day, and nothing compares. And these guys make it finally affordable for the version you want!\n",
        "date": "June 1, 2015",
        "verified": true,
        "helpful": "9",
        "image_urls": []
    },
    {
        "author": "Elipsis17Twelve",
        "rating": "2.0",
        "title": "Refurbished, NOT \"Open Box\" - found 3rd party hardware for integral structural parts.",
        "content": "\nAfter having it for a few months, I wanted to do a quick write-up.The chair itself seems ok. It looked great out of the box, no major issues seen on the outset. After some time, I noticed the armrests were uneven when they were all the way up or down. I checked out the source of the unevenness, and the part that they fasten to - which is a major structural part of the chair and is what you attach the backrest and seat to - were not sitting evenly. One had a lot more \"play\" than the other, so I started taking things apart and was finding that most of the larger parts all seemed to be genuine Herman Miller parts, but they had taken some liberties with refurbishing the chair.That's what this chair seems to be in my case, refurbished, not \"open box\", which is a staggering difference in expectation.I don't have any Herman Miller experience, but in the few hours I've been working on my issues with the chair, I've found that there are definitely some problems with the product they sold me which I had not picked up on outside of the 30-day window and I may keep the chair and just buy some parts and fix it up.\n",
        "date": "August 26, 2017",
        "verified": true,
        "helpful": "12",
        "image_urls": []
    },
    {
        "author": "Richard B",
        "rating": "4.0",
        "title": "Very nice Aeron chair",
        "content": "\nIt's a great chair. The one I received is clearly not new. The description was that it was \"Open Box ! \"We can't advertise \" NEW \" But you Decide!\" I decided it is clearly not new. There are a few minor scratches on the handles, and the arm rests show some minor wear as well. The chair creaks a bit, too. HOWEVER, the chair works perfectly. It was packed well, and arrived in very, very good condition. The packing was not factory packing, but it did the job well. Chair assembly was a cinch. Four allen bolts attached the back to the base of the chair, and the allen wrench was provided. I'm pleased with my purchase.\n",
        "date": "March 30, 2016",
        "verified": true,
        "helpful": "23",
        "image_urls": []
    },
    {
        "author": "crankypantsBK",
        "rating": "5.0",
        "title": "A real Herman Miller Aeron chair at half the price!",
        "content": "\nWow, it's true. I am now sitting in an actual Herman Miller Aeron Chair AT HOME, like I always wanted, but at half the cost of one.I've been using one at work for about seven years, and the home office chair back at home, where I do most of my work, just wasn't cutting it. I really wanted a chair like the one at the office. Well, thanks to Madison Seating, I have one, fully loaded, with lumbar support and adjustable arm height, for a fraction of what a new HM Aeron typically goes for.I received it in 2 days, too, which I consider a bit of luck. All I had to 'assemble' was the chair back, which requires tightening four Allen bolts (Allen wrench included). It's really really great and I could not be more pleased with this purchase. Best decision I could have made, after years of bad, cheap home office chairs. Thanks, Madison Seating, you have a new fan!\n",
        "date": "September 8, 2017",
        "verified": true,
        "helpful": "6",
        "image_urls": []
    },
    {
        "author": "Scott M",
        "rating": "5.0",
        "title": "Most comfortable office chair I have ever owned",
        "content": "\nI work from home and spend a large portion of the day sitting in front of my computer.  I have an adjustable height desk but some recent problems have me staying off my feet as much as possible for a few months.  So, I decided to spend some money on a better chair.  The chair I was previously using was an old solid wood office chair with no padding and very limited adjustability.  After searching around and shopping at a few office furniture stores I decided on the Aeron.The difference between the Aeron and other chairs I have used is very noticeable.  It is beyond comfortable and helps me to improve my posture by making it more comfortable to sit straight up vs leaning forward on my desk while typing.  Yes, it is expensive.  But, with the warranty and features it offers is definitely worth it.Even the box it is shipped in is impressive.  A corrugated box that is so strong (and heavy) you would think it is a wooden crate.  My chair arrived in absolutely perfect condition.\n",
        "date": "July 25, 2013",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Michael Michel",
        "rating": "1.0",
        "title": "Not new/second hand refurbished item",
        "content": "\nThe chair back was defective and no way to contact for support or replacement.  Only option is to send back at my expense.  I’ll just live with it I guess until it fails.  My third Herman Miller chair so I know the quality to expect.  This chair was scratched and dirty and when I attempted to contact Herman Miller which was the contact given through the Amazon help function their reply was that Amazon isn’t an authorized retailer and good luck!\n",
        "date": "December 4, 2023",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Golfing Eagle",
        "rating": "5.0",
        "title": "Herman Miller's Aeron Chair is Everything it's Cracked Up to Be",
        "content": "\nI had an Aeron chair where I worked ten years ago, and have never found another chair that came close to its quality, comfort and value.  I finally had the opportunity and the extra cash to buy one for myself, and I'm glad I did.I ordered it on a Sunday afternoon and it was delievered Tuesday morning before noon, and Amazon Super Saver shipping was free and promised delivery in 7-10 business days!Assembly was a snap.  Found a two-minute video on YouTube on how to assemble the chair from opening the carton to attaching the seat back with four easy bolts an the Allen wrench provided.  Could not be easier.I would recommend this chair to anyone.  It will last decades, without degradation in comfort, support or the various adjustments and mechanisms, all covered by a 12-year warranty.Considering a lesser cost chair will only hold its quality fo a couple of yeas, this chair will pay for itself in six to eight years.  Remember the old adage - you get what you pay for.\n",
        "date": "December 12, 2012",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Eric J. Kovach",
        "rating": "4.0",
        "title": "Great chair but too small.",
        "content": "\nI really wanted to love this chair, but alas, it wasn't the right chair for me ergonomically. The front edge of the seat put a lot of pressure on the underside of my thighs, causing pain and numbness. I was in the B or C section of the chart and I probably should have gone with a C. The price of this one was hard to resist. Feature wise, the chair was amazing. If I was a little smaller, it would have been perfect.Madison Seating was great to work with. Their packaging was perfect and they accepted my return with no questions.\n",
        "date": "September 27, 2016",
        "verified": true,
        "helpful": "5",
        "image_urls": []
    },
    {
        "author": "Greg",
        "rating": "5.0",
        "title": "Works great. Gave to my sister to replace her gaming chair.",
        "content": "\nReal deal classic. Aluminum frame. People say the remastered is better, but I’ll take metal over plastic products. Was in great condition. I had a problem with the lever and the seller was very quick and responsive to fix it. I ended up giving the chair to my older sister who wanted to replace her (cheap) gaming chair. Thanks.\n",
        "date": "December 1, 2022",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "AMM",
        "rating": "1.0",
        "title": "USED PRODUCT!!!",
        "content": "\nThis chair was clearly used - that was not made clear to me when I went to buy it.I am willing to accept a replacement, but it has to be NEW or I want my money back in full.And I need the shipping money reimbursed as well.Thank You\n",
        "date": "December 26, 2023",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": [
            "https://m.media-amazon.com/images/I/71e1Co+PrqL._SY88.jpg"
        ]
    },
    {
        "author": "Captain Latte",
        "rating": "5.0",
        "title": "Best Deal for Aeron Chairs",
        "content": "\nI had been holding off for the annual Herman Miller sale to get a new Aeron chair for our recently remodeled home office. By chance, I noticed these guys offering the Aerons at a very good price. I was a bit hesitant ordering the chair from Madison as there were no reviews yet. But the price was just too good so took a chance (I bought the Aeron with lumbar support based on a friend's recommendation). I will say that my experience with them was top-notch. The chair was sent out immediately and arrived within a week. Everything arrived in perfect condition and was easy to setup. I won't go into the details of the chair as there are plenty of other reviews on Amazon that cover Aerons. Anyways, I'm very happy with the chair so far and would not hesitate to recommend these guys if you want a great price on an Aeron.\n",
        "date": "April 4, 2015",
        "verified": true,
        "helpful": "35",
        "image_urls": []
    },
    {
        "author": "Skyler Hudson",
        "rating": "5.0",
        "title": "A Classic Aeron Chair",
        "content": "\nI have had this chair for a few months and spend between 3 - 12 hours each day on it and feel comfortable enough to write a review for it now.Positives - I did not notice any blemish or wear and tear or damage on this refurbished chair when I received it. It is comfortable and does not make my back hurt from prolonged sitting, like my previous chair. The Herman Miller video was educational - I was never aware of the recommended position for sitting and working.Negatives - the plastic lumbar support bar seems to fly off the rail if I recline back hard enough once in a while; expensive and somewhat heavy.Summary - I would probably buy the refurbished HM chair again. I only wish the lumbar support would not come out that easily.\n",
        "date": "February 21, 2018",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "CFT",
        "rating": "5.0",
        "title": "comfy",
        "content": "\ncomfy\n",
        "date": "September 6, 2023",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Joe V",
        "rating": "5.0",
        "title": "Excellent condition and looks authentic.",
        "content": "\nChair looks great.  My main concern was whether this was a true Herman Miller or some knock off, given the price.  So, I took it apart and compared it to pics I could find on the web that are Herman Millers.  The tilt mechanisms look correct, and show no sign of any wear.  There are a few scuffs on the chair back, but otherwise the chair is in excellent condition. It almost looks new. You will need a 5 mm Allen wrench (not provided) to screw in the four bolts that attach the chair back to the chair (3/16\" will also work), so it's basically no assembly.  I notice that the cost of the chair has gone up more than $100 since I purchased it a few weeks ago. Perhaps the price fluctuates significantly over time.\n",
        "date": "August 6, 2017",
        "verified": true,
        "helpful": "3",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/71+i8TL34LL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71+phnfaIGL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/717cXbJgakL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71GvklJ-NcL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71LPUlJzUoL._SY88.jpg"
        ]
    },
    {
        "author": "James D. Amis",
        "rating": "3.0",
        "title": "Beware of \"non-certified\" sellers",
        "content": "\nI purchased this chair in August 2018. Several months ago I notice the left armrest had developed a split in it. It continued to develop more splits so I contacted Herman Miller today. They informed me that the armrests I described were not original Herman Miller parts and, therefore, they could not honor their 12 year warranty. Madison Seating is listed as the seller and Herman Miller told me that this seller is not an authorized dealer. I love the chair, but now I have to replace the armrests for $75.00.\n",
        "date": "February 6, 2020",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/71bT2vMxuOL._SY88.jpg"
        ]
    },
    {
        "author": "Jody",
        "rating": "2.0",
        "title": "Made an investment but disappointed in it & customer service",
        "content": "\nI bought this chair for my home office. I had used one at a prior company and it was wonderful so I didn't mind investing money to get something worthwhile and comfortable. It's been three years since I purchased my chair and I've attached pictures to show it's still in great condition. The exception is the left armrest which has ripped and is coming apart. The right armrest is completely fine. There's supposed to be a warranty on the chair according to the information on my order  from Madison Seating, but they have since updated it (years later) to not include the armrest which is unfortunate. I've reached out to Herman Miller customer service and Madison Seating customer service (they are the ones I purchased this from) - both have told me I can pay money to buy the armrest and provide no other solution. For a chair that is near $600 I would expect more from customer service to get this fixed. I will not be buying another chair from them again.\n",
        "date": "October 25, 2018",
        "verified": true,
        "helpful": "4",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/71c+BvUMY7L._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71oBF8kiKzL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81ZxWauSFoL._SY88.jpg"
        ]
    },
    {
        "author": "G. Jacobs",
        "rating": "2.0",
        "title": "Such an overrated chair.",
        "content": "\nI bought this chair because it is so highly praised. Yes, it's better than most office chairs, but it is still nothing to rave about and not worth the exorbitant price. The arm rests are my biggest complaint. For some reason they are made to pivot inward or outward, but I find this \"feature\" completely useless. I'd rather they be able to slide in or out rather than just pivot. You can't lock them to prevent them from pivoting, so they often get bumped into positions I don't want them in. Very annoying. And overall the chair just is not all that comfortable for me. Mesh really can never replace a good cushion, no matter how high quality the mesh is. My other complaint is how needlessly heavy this chair is. The base is solid steel, but what advantage does this really have? The chair is not any more solid than other more affordable chairs I've used. This chair still creeks and pops and wobbles like any other desk chair I've used. In my opinion your money is better spent on something else.\n",
        "date": "June 18, 2017",
        "verified": true,
        "helpful": "3",
        "image_urls": []
    },
    {
        "author": "TS",
        "rating": "5.0",
        "title": "Worthy investment in our home office",
        "content": "\nWe run our software dev company from home - this means lots of hours spent sitting and coding for my husband. We knew we wanted to treat this purchase as an investment - it's a tax deduction and will ultimately increase productivity. After reading every single review available for the higher-end chairs I settled on this one. So happy with our choice.The chair arrived sooner than expected and was packed nicely, very easy assembly, no fuss at all. One of the best investments we've made in our company. Would never go back to a 'regular' chair again after this purchase.We got the Classic Carbon color and it looks great. The large size C fits my 5' 10\" 190lb husband perfectly.Though it's only been in use for a week at this point, the quality materials and construction lend themselves to durability. The 12 year warranty is nice as well.Great purchase overall!\n",
        "date": "March 24, 2011",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Celestron",
        "rating": "5.0",
        "title": "Best chair ever",
        "content": "\nThis is the brand my employer provided us with for years and after the last merger (too big to fail...) they were replaced with cheaper ones. Don't need to say they are so uncomfortable. So, due to lower back and hip problems I know work from home most of the time but the one at home, even when is more comfortable than the one at the office wasn't helping me much at the end of the day.I finally decided to spend the extra money to see if my evenings has ay improvements and...  oh man... I now regret waiting this long to get it!!I was a bit concern of buying the Size B but my 5'11\" / 245# fits perfectly. It's the same size of the one I had at work for 8 years.\n",
        "date": "August 23, 2016",
        "verified": true,
        "helpful": "10",
        "image_urls": []
    },
    {
        "author": "Mark Peterson",
        "rating": "5.0",
        "title": "You get what you pay for...",
        "content": "\nAs the implies, you drfinitely get what you pay for.I first experienced the Aeron chairs a few years ago in an office that I worked in and thought that they were probably the most comfortable chair I've ever sat in. I've had several other computer chairs over the years for personal use, but none ever compared to these.While the chairs are expensive, they will last you as long as the warranty which is 10 years from purchase. The build quality is absolutely impeccable. The all mesh seat and back are very supportive of the body for long periods of time. There are no cushions to wear out or to conform to you which would eventually become uncomfortable over time.If you are in the market for a great comfortable chair because of massive time spent at a desk, you can't go wrong with spending the extra money and getting something that will last.\n",
        "date": "January 15, 2013",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Amazon Customer",
        "rating": "2.0",
        "title": "Looks fine, but unable to adjust anything.",
        "content": "\nIt arrived with a leg poking through a hole in the box, and the levers to tilt the seats don't do anything.  I knew it wasn't new, but I expected to be able to make adjustments, at least.\n",
        "date": "May 31, 2023",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Chris Waldorf",
        "rating": "5.0",
        "title": "Outstanding and durable chair",
        "content": "\nI've been using these chairs for nearly twenty years now and still love them.  They provide tremendous comfort and happiness.  As an investment, though these are more expensive upfront than most other chairs, they are built like tanks and last.  Even the chair at work that I've had for about fifteen years still looks in excellent condition.I've been so happy with them that I've bought nearly ten others for people in my company.  People with back problems have had those virtually eliminated.  Even if one looks at just the twelve year warranty period, the cost works out to be about $7 a month.  When one looks at the bigger picture, these chairs are less expensive than cheaper chairs that don't last nearly as long and don't provide nearly the ergonomic comfort.\n",
        "date": "December 31, 2015",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Cameron Johnson",
        "rating": "5.0",
        "title": "Point being I spent 5k a a chiro with no great luck but within a month of ordering this chair ...",
        "content": "\nI'm a computer engineer, I'm in a chair all day. Hit a lazy/stressful patch and was sitting in my OLD chair 60+ hours a week. That brought back an old lower back injury. I couldn't walk for almost an entire summer due to a sciatica problem. Couldn't drive to work or even get out of bed some days. I'm not an obese guy either. 200 and fairly fit just fell of a bridge at 18 and I can't let my back get away from me. Point being I spent 5k a a chiro with no great luck but within a month of ordering this chair I was walking much better, within 3 months I was feeling pretty good. Almost 10 months later I'm back to normal. I made some other lifestyle changes but I always tell people this chair is what fixed me.\n",
        "date": "April 30, 2015",
        "verified": true,
        "helpful": "5",
        "image_urls": []
    },
    {
        "author": "C. F. Greene",
        "rating": "4.0",
        "title": "Love this chair!",
        "content": "\nLove this chair. I can sit in it for a long time with no butt or back fatigue. It adjusts every way I need it to and is super comfortable! Doesn't loosely rock back and forth on it's axis like some cheap office chairs do. Stays solidly level. The only thing it doesn't do well: if you want to play guitar in this chair realize the arms are movable they but don't get completely out of the way to play comfortably.\n",
        "date": "February 21, 2017",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "John Cross",
        "rating": "5.0",
        "title": "Super comfortable and supportive and great customer service from distributor.",
        "content": "\nThis is truly a great chair and completely worth the price.  I consider this an investment in health.  The lumbar support is super easy to adjust, and unlike so many comfy chairs, it breathes so it is never hot sitting in it for long periods.  One of the chairs we ordered came with a defective caster.  Within just a few hours I received an email from the distributor apologizing for the inconvenience, and a few days later, I received TWO replacements.  THANK YOU!  Very happy to give both the chair and the company a gold star.\n",
        "date": "September 12, 2020",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "shoshannasings",
        "rating": "5.0",
        "title": "Wonderful chair",
        "content": "\nMy husband bought this for me to use at work since I sit at a desk in front of a computer for most of the day.  It is a wonderfully comfortable chair. I didn't realize that I carried tension in my arms, lower back, and legs until I got this chair. It has made a world of difference. I don't feel physically fatigued in my muscles the way that I used to after an 8 hour day at work. I believe these chairs are worth the money and I am enjoying mine immensely. The quality appears to match the price point in looks as well as function and, so far, delivers all that is promised. Great chair!\n",
        "date": "October 27, 2017",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "seanbreeden",
        "rating": "5.0",
        "title": "Great chair!",
        "content": "\nMy wife has back problems and this chair is great for her for when she has to sit for long periods of time in front of the computer.  I used an Aeron Chair at my last office job and already knew about their high quality.  I paid 1/2 price for this chair and have been very pleased with it.  I wait for a while before writing reviews for things like this just in case it would break 2 weeks in.  Well, I can confidently say that this chair is top quality and isn't breaking down any time soon.  Unlike cheaper chairs you get from outlet stores or other brands online, this chair arrived mostly assembled.  We just snapped the back on and it was good to go.\n",
        "date": "September 6, 2015",
        "verified": true,
        "helpful": "4",
        "image_urls": []
    },
    {
        "author": "book mule",
        "rating": "4.0",
        "title": "I knew that I would like this chair as we used the same thing where ...",
        "content": "\nI knew that I would like this chair as we used the same thing where I worked for the past 10-12 years. It was a 24 hr. per day,7 days a week facility. The chairs were always in use. They stood up to that use so they would be good at home also. The only problem was that when the chair arrived the bolts necessary to assemble it were not packed with it. The company sent the bolt right out when I notified them though, so I'm satisfied.\n",
        "date": "October 16, 2015",
        "verified": true,
        "helpful": "2",
        "image_urls": []
    },
    {
        "author": "Frank Perkins",
        "rating": "5.0",
        "title": "Looks good and performs",
        "content": "\nI recently started working at home full time and my old computer chair I purchased in the late 90's was absolutely killing my back.  It got to the point I couldn't even walk without a limp at the end of the day.  Considering I would be sitting down for 8-10 hours a day I thought this chair would be a good investment and it sure does look good.I know most of the price is the brand name, but I really couldn't find any suitable alternative.  I looked at some of the chairs at office depot, staples, etc and they just looked cheap.I'm happy to say that I feel no discomfort in sitting in the chair all day and I'm very happy with my purchase.  If you have the money, go for it.\n",
        "date": "December 11, 2012",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Sue C. Dees",
        "rating": "5.0",
        "title": "The Rolls Royce of Chairs",
        "content": "\nI just got my chair today. I am now working remotely due to mobility issues and I had a chair like this at work, but couldn't bring it home. This is the only chair I have found that I can sit in for long hours. It arrived in two pieces. Once I got it upstairs (no small task) all I had to do was put the back on and adjust the height, lumbar support and arms. I already had a headrest and I added that and I am already enjoying this chair. I know it's not \"new\" but you could of fooled me. This chair is pristine. You can't go wrong.\n",
        "date": "October 26, 2016",
        "verified": true,
        "helpful": "4",
        "image_urls": []
    },
    {
        "author": "Penny",
        "rating": "5.0",
        "title": "The real thing . . .",
        "content": "\nWhat can I say?  I've used a Herman Miller Aeron chair for the last ten years.  When we sold the furniture with our house, I had to go shopping for an office chair again - I tried all the usual (lower-priced) suspects and ended up realizing that if I wanted real comfort I'd just have to bite the bullet and shell out the money for the real thing again.  By the way that ten year old chair looked brand-new even after 10 years of daily use.(The Madison Seating price on Amazon was a little lower than on the Madison Seating site, but this can change.  Best to check both sites before ordering)\n",
        "date": "March 10, 2016",
        "verified": true,
        "helpful": "4",
        "image_urls": []
    },
    {
        "author": "Boyhowdy",
        "rating": "3.0",
        "title": "Buy a better version.",
        "content": "\nThe Aeron chair is incredibly adjustable and comfortable. And I’m satisfied with with that. However the lumbar pad on the one I bought is a cheap piece of plastic that constantly moves up and pops out of its track which is unbelievably annoying. I don’t know if that’s true of all models but the refurbished version I bought on here, while well priced, is disappointing.\n",
        "date": "March 14, 2018",
        "verified": true,
        "helpful": "2",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/81Jg8Gpc4yL._SY88.jpg"
        ]
    },
    {
        "author": "unixcorn",
        "rating": "5.0",
        "title": "Comfortable all day",
        "content": "\nI have been using an Aeron chair at work for the last 7 or 8 years. I am a programmer and a new job is allowing me to use my home office. The chair I had was great for the 1 or 2 hour stints I would spend in it from time to time but for real work 8-10 hours each day it was woefully inadequate. The Aeron chair is expensive but, in my opinion, worth every cent. Besides its stellar warranty, 12 years I believe, the chair is adjustable any way I like. The fabric is strong yet pliable and I can adjust the chair for several different comfortable positions throughout the day. If you need to sit all day, I highly recommend this chair.\n",
        "date": "May 3, 2013",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Urick Estep",
        "rating": "5.0",
        "title": "Ultimate chair",
        "content": "\nThis chair is basically a long term investment in your sitting comfort. If you spend long hours in front of a computer, it provides many adjustments to accommodate your experience. I have one built in 1997 and it has had minimal maintenance; the arm covers, the piston vertical adjustment mechanism, the back and seat fabric all have held up well. The forward and backward tension has weakened over the 16 yrs of ownership though. I would not call this a defect but an expected normal wear phenomenon. My wife bought another brand of chair several years after my first chair and this Aeron is to replace it. In contrast her chair looked like a refugee from a hobo camp. Go with quality and enjoy the ride.\n",
        "date": "December 31, 2012",
        "verified": true,
        "helpful": "4",
        "image_urls": []
    },
    {
        "author": "drkkw",
        "rating": "5.0",
        "title": "Herman Miller's Aeron Chair Best Ever!",
        "content": "\nI have had a good number of office chairs between my 2 business offices, and my home office over the last 25 years.This Aeron chair, is far and away, the BEST chair I have ever sat on!Numerous adjustments, and just the right amount of softness/firmness, to make working and sitting for hours, very comfortable.(The size \"B\" seems perfect for me being 6' tall and 190lbs)You can spend a lot less and get chairs like I've had before, and be barely satisfied, or you can invest in yourself and spend a bit moreand actually love your purchase and work in absolute comfort.\n",
        "date": "February 14, 2017",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Kevin",
        "rating": "5.0",
        "title": "I just knew the different ones that were \"passed down\" to me previously really sucked for one reason or another",
        "content": "\nI didn't really shop around for a chair, I just knew the different ones that were \"passed down\" to me previously really sucked for one reason or another. I had sat in the Aeron, on occasion, at a business i frequented, and had taken the comfort and adjustability for granted. When I started to spend more time on the computer at home, in multiple uncomfortable chairs, is when I realized how bad my chairs were. I got this one and I love this chair, I can't say that the 900.00 price tag is without question worth it for someone, but I am over the price now mainly because my back and rear don't hurt anymore. This thing is pretty sweet for a piece of furniture.\n",
        "date": "November 4, 2014",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Brian P Gregus",
        "rating": "3.0",
        "title": "Enjoyed the sub 5 minute setup",
        "content": "\nThis chair was purchased for home use.  Enjoyed the sub 5 minute setup.  It's comfortable and there is no visible marring of any surface.  There is a side to side wobble which makes me believe the chair's attachment to the central post is compromised and might worsen or fail.  As a comparison Aerons at the office did not have this issue.\n",
        "date": "October 19, 2017",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Chris Alleaume",
        "rating": "4.0",
        "title": "Chair is great. Beware of sizing.",
        "content": "\nThe chair itself is great. The sizing chart is a bit weird though. If you fall into the range of \"either B or C\", I suggest you go for the size \"C\". I saw this advice elsewhere and didn't follow it, thinking I knew better. I was wrong. The B was definitely the wrong size and hurt my thighs.The size C I have now is superb.\n",
        "date": "April 19, 2016",
        "verified": true,
        "helpful": "5",
        "image_urls": []
    },
    {
        "author": "Kindle Customer",
        "rating": "5.0",
        "title": "This chair is a dream.",
        "content": "\nI was initially nervous given some negative reviews but this chair has been a dream. I've been using it daily and it is wonderful. Comfortable and solidly built, I'm very happy with this purchase.I used Aerons during the .COM boom and they are still a solidly built chair.The seller (Madison Seating) reconditions these chairs well.  Includes good clear instructions.I will say that there's initially a bit of a chemical smell but it dissipated after a while.  Madison seems to have done a really good job on my chair.\n",
        "date": "February 27, 2018",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Drew",
        "rating": "5.0",
        "title": "So far so good",
        "content": "\nThis chair is very comfortable. You might want to invest in a headrest for it. Going from your standard office store chair to this is incredible.I am a big guy and I was hesitant to go with this one vs some of the others that were rated for a higher weight capacity. I weigh about 250 right now. I have absolutely no problems with it supporting me even after using it all day.I was also concerned about the mesh design but it feels solid and doesn't feel like its going to have any problems. Somehow my cat doesn't seem inclined to shred it which was my only other concern.I feel it was worth the money.\n",
        "date": "April 13, 2013",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Nick",
        "rating": "5.0",
        "title": "Great quality product",
        "content": "\nI use the chair part time in my home office.  The chair is a great quality product.  It has many adjustments to set it up for proper ergonomics while working.  I  purchased one for my wife as well at the same time and we are both extremely pleased with the support and the comfort of the chair.  The overall construction of the chair is excellent (cast aluminum base & some type of polymer for the seat) so I don't think I'll be purchasing another chair anytime soon. I agree with some reviewers that they are a bit expensive (especially when buying 2) but I believe they're still a great value.\n",
        "date": "August 18, 2011",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "J. Rice",
        "rating": "5.0",
        "title": "BEST CHAIR I'VE EVER SAT IN",
        "content": "\nIf you can, try and find a high-end furniture place and try and sit in one of these things.If you cannot, like me, just get one. I was somewhat hesitant about buying one before actually sitting in one, but it didn't disappoint!I used to buy my chairs from Office Depot for $200 and they would hurt my back and fall apart after a year or two. Never again!If a fire suddenly broke out in my apartment I'd put my computer on this chair and roll out the door!If you're on the fence, JUST GET IT! Your back will thank you later!\n",
        "date": "March 3, 2016",
        "verified": true,
        "helpful": "4",
        "image_urls": []
    },
    {
        "author": "Angela B. Omara",
        "rating": "5.0",
        "title": "smartest purchase ever made",
        "content": "\nThis chair is unbelievable!  I was reluctant to spend this amount of money on an office chair.  But after considering that I sit in my office close to 8 hours a day, I started thinking about it as an investment similar to a mattress (which I probably spend the same amount of time on nightly).I have chronic back pain from sitting in the wrong chair for years and this chair has relieved it!  It is not only comfortable but forces you to sit in an upright position with it's fantastic support.  It is the most comfortable seat in my house.This chair is priceless!\n",
        "date": "June 4, 2010",
        "verified": true,
        "helpful": "2",
        "image_urls": []
    },
    {
        "author": "MaineMom",
        "rating": "5.0",
        "title": "Excellent Value, Product, and Company - I would buy this again!",
        "content": "\nI had a hard time spending that much money on a chair, but I'm SO glad I did!  The chair arrived 4 days before the earliest promise date.  It was perfectly packaged, all parts included, everything in brand-new condition.  It was simple to put together, the instruction booklet told us exactly how to adjust it to fit my body perfectly. I have never felt so comfortable in a chair before and my back pain is totally gone.  I'm amazed that a chair could make such a difference. This is an excellent product, excellent company and I would spend the money again in a heartbeat!\n",
        "date": "January 21, 2016",
        "verified": true,
        "helpful": "30",
        "image_urls": []
    },
    {
        "author": "Jordan Johnston",
        "rating": "3.0",
        "title": "Seems legit",
        "content": "\nLike one buyer mentioned, definitely a noticeable paint smell. It's definitely used but you can't expect mint condition for half the price. The scuffs aren't noticeable when sitting or if I have a visitor so not a huge deal. Would be nice to have it perfect but o well. It's extremely comfortable and as far as I can tell, it's a legit Herman miller chair.\n",
        "date": "January 14, 2017",
        "verified": true,
        "helpful": "5",
        "image_urls": [
            "https://images-na.ssl-images-amazon.com/images/I/715OFWwXmsL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71UUI5H-UBL._SY88.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71usUcQNivL._SY88.jpg"
        ]
    },
    {
        "author": "B. Simpson",
        "rating": "5.0",
        "title": "The Best Chair",
        "content": "\nI've used one of these chairs since 1998 and when I switched jobs, I had to go back to a \"normal\" chair.  Needless to say I missed the Aeron everyday and after a year convinced my employer to purchase this chair.  After I got it now everyone in the office wants one.  While they are not cheap, just think about how many days you use this chair and divide that cost into the price.  You will quickly see they are worth it considering how many hours you sit in these chairs every year.  These chair also have high resale value which is unusual for office furniture.\n",
        "date": "July 29, 2011",
        "verified": true,
        "helpful": "3",
        "image_urls": []
    },
    {
        "author": "Ben Miller",
        "rating": "5.0",
        "title": "Size guide size guide size guide",
        "content": "\nThis is the second Aeron I've had in a month because the first one was too small.  I used Herman Miller's size guide and found the first chair (size B) to be too snug, even though the company said I should fit.  I used OfficeDesigns size guide the second time around, and found I fit in the larger chair (size C) much more comfortably.The chair forces you into correct ergonomic posture, and also allows your skin to breath while working at a desk for long periods of time without embarrassing sweat marks.  The 12 year warranty is another nice feature, showing the company really stands behind their products.\n",
        "date": "December 10, 2012",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Miguel Kuster",
        "rating": "5.0",
        "title": "This chair is amazing. Even when sitting hours behind the PC I ...",
        "content": "\nI have had 2 mediocre chairs before this one, that broke down after a year. I decided to got with a premium chair. This chair is amazing. Even when sitting hours behind the PC I can barely notice any fatigue. In fact, the chair is so comfy I find myself dosing off while working.I life in a temperate climate, so the mesh is wonderful for keeping me nice and cool.Hands down the best chair I have ever had. Now I just need one for work.\n",
        "date": "March 5, 2018",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Cindy",
        "rating": "5.0",
        "title": "I decided to search for a quality chair that would offer better \"seating\" and hopefully comfort for the times that I ...",
        "content": "\nI purchased the Aeron Chair by Herman Miller for home use.  My occupation (office work) has me sitting hours at a time.  There will be many days where my legs will ache from the use of the chairs at my employment. I decided to search for a quality chair that would offer better \"seating\" and hopefully comfort for the times that I would be doing work from home.  I had read several good articles about the the Aeron Chair and thought it would be nice to give it a try.  I must say, it is the best chair I have ever had in 30 years.\n",
        "date": "August 3, 2015",
        "verified": true,
        "helpful": "7",
        "image_urls": []
    },
    {
        "author": "Marie C. Stauber",
        "rating": "5.0",
        "title": "We love this chair",
        "content": "\nWe love this chair.  I got tired of buying office chairs at the local office supply and having something go wrong after a year or two.  This has a lifetime warranty!  And it is so comfortable!  It adjusts every way possible.  The mesh is ventilated so it keeps you comfortable no matter how long you are sitting at your desk or in front of the computer.  And it looks so stylish.  My husband gets compliments on it and we'd like to pass them along.  You make a very high quality product.\n",
        "date": "September 16, 2016",
        "verified": true,
        "helpful": "4",
        "image_urls": []
    },
    {
        "author": "Amazon Customer",
        "rating": "2.0",
        "title": "Read the return policy!",
        "content": "\nThe chair I received had a broken tilt tension control.  I returned it, but had to pay the shipping, which came to almost $200 from Colorado!\n",
        "date": "November 5, 2022",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "John Sturmanis",
        "rating": "5.0",
        "title": "Back feels better",
        "content": "\nFor 17 years I used the same office chair thinking it was good enough.  My back got progressively worse, mostly from age.  This chair allows me to sit for long period of time in comfort with my posture at the desk nearly perfect.  For me it was more than worth the money for something I use daily.  Also, the other reviews mention the adjustable lumbar pad.  I can't imagine not being able to make this adjustment and recommend this less expensive option.\n",
        "date": "January 4, 2013",
        "verified": true,
        "helpful": "2",
        "image_urls": []
    },
    {
        "author": "Erik L. Wolff",
        "rating": "5.0",
        "title": "Best desk chair I have ever owned!!",
        "content": "\nWhen ordering this chair, all my co-workers thought I was crazy. But after getting the chair... All I can say is WOW!!!! I spend a great deal at the computer so I can be rough on my desk chairs. The hydraulic lift is solid, don't worry about any give. The adjustable arm rests can hold my full body weight leaning on them. The only thing I would improve would be I wish there was a way to lock the arm rests from rotating in and out. I think they rotate a little too easy for my comfort, but it isn't a deal breaker.\n",
        "date": "April 17, 2012",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "RR",
        "rating": "5.0",
        "title": "Comfortable, durable, adjustable",
        "content": "\nThis is a great chair--the same one that I have at work. The mesh is sturdy and never deteriorates. The lumbar support is easy to adjust, as is tilt, arm height, and seat height. Size B is the regular sized version. If you are tall or over 275 pounds, I recommend the larger version. It arrives preassembled. Just unscrew 4 screws using a 3/16\" allen wrench, slide on the back, and put the screws back in. The whole process takes less than 5 minutes.\n",
        "date": "December 25, 2017",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Robin K. Mcentire",
        "rating": "5.0",
        "title": "They were like brand new!!",
        "content": "\nWe ordered 4 Herman Miller Aeron chairs, sized C. They wanted to confirm that they received the order correctly and called me on a SUNDAY to confirm!! Very impressive. The chairs look brand new! One had a caster damaged in shipping, but I'm not going to worry about it. It works fine and it's in one of the back rooms, so no one will see it. Thank you for providing such a wonderful product at about half price!!\n",
        "date": "July 25, 2018",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Tristanism",
        "rating": "3.0",
        "title": "Hype",
        "content": "\nI guess I really don't understand the hype around Herman Miller Chairs. I bought this hoping that a more adjustable chair would help ease my chronic neck/shoulder/upper back pain. Well, it didn't help at all. Yes, it's a quality chair. But $1,000? No. I returned it as the $150 chair was just as painful to sit in as this one.\n",
        "date": "December 13, 2016",
        "verified": true,
        "helpful": "5",
        "image_urls": []
    },
    {
        "author": "Beatriz",
        "rating": "5.0",
        "title": "Good lumbar support",
        "content": "\nI bought this chair for my husband. He has the same chairs in his office at work. For him, the chair is very comfortable to sit on for an extended period of time. He really enjoys the lumbar support the chair offers. The lumbar support piece is adjustable depending on your comfort level, it can also be removed if you do not like. The armrests are also adjustable, either upwards/downward or inwards/outwards. So overall this chair was made for a variety of comforts.\n",
        "date": "November 29, 2017",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Doctor",
        "rating": "5.0",
        "title": "As good as new!",
        "content": "\nArrived in excellent condition, had a hard time telling it was used. And I have a very low threshold for items with wear. After 3 months, still in great condition,  very comfortable. I was born with kyphosis and this has helped relieve the daily agony of prolonged sitting, which as I age seems to be more of an issue. Does collect 'fiber dust' under the seat after a while, but otherwise a well built product with great service and excellent packaging should last for years.\n",
        "date": "May 2, 2016",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Galen M.",
        "rating": "5.0",
        "title": "Best office chair ever - forget about the price and just do it.",
        "content": "\nI love this chair! I have had it for at least 6 months now. You forget about the price for the comfort this chair offers. I can sit in this chair working for 12 hours without feeling terribly uncomfortable like I would in a normal office chair (my last chair was a Steelcase). It was also good for me because I'm tall (6'4\") and normal office chairs aren't able to offer the adjustment options that the Aeron Chair offers. I think without this chair, I would definitely have carpal tunnel by now because of how awkward other chairs were.\n",
        "date": "October 31, 2015",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Charles T Smith Jr",
        "rating": "3.0",
        "title": "It must be me, but...",
        "content": "\nThe mesh seat cut across my the back of my legs.  I could not get comfortable.  Probably my bad because I tend to sit more forward toward the front edge of the chair.  The no quibble guarantee was for real.  I returned it with no problem.The chair quality was excellent.\n",
        "date": "April 22, 2016",
        "verified": true,
        "helpful": "10",
        "image_urls": []
    },
    {
        "author": "Vitalii Honcharenko",
        "rating": "5.0",
        "title": "Really cool",
        "content": "\n+ agronomic+ nice look+ my back can't say \"thank you\" enough+ full mesh+ all parts adjustableIt's my second one. First chair used for 5 years - very satisfied, had to sell because of relocation.I'm using this one for a year. still look as new.\n",
        "date": "May 13, 2020",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Philip L. Reynolds",
        "rating": "1.0",
        "title": "An instrument of penance.",
        "content": "\nI am very disappointed with this chair. It's neither comfortable (it's unyielding and pokes in all the wrong places) nor orthopedic (it gives me back ache). The seat is hard, and because it's not properly contoured at the front it cuts off the circulation in my legs. An added 2-inch thick seat cushion helps with that but puts the lumbar contour in the wrong place. The lever that controls how far back the chair tilts doesn't work properly - to get the desired degree of tilt requires repeated hit and miss attempts to get close. It's very heavy, which would be worth the inconvenience if it was a comfortable and healthy chair, but it's not. The chair that it replaced, which cost less than $200, was not perfect but it was far more comfortable and healthier for my back than this one.\n",
        "date": "October 22, 2017",
        "verified": true,
        "helpful": "5",
        "image_urls": []
    },
    {
        "author": "Joe Colonnello",
        "rating": "5.0",
        "title": "Great chair.  Great company.  Highly recommended.",
        "content": "\nI love this chair.  I have lower back issues and I am very happy that I made an investment in this chair, as it has helped to alleviate a lot of the soreness resulting from sitting in front of a computer all day.  I also want to compliment Madison Seating.  I had to contact them after the chair was delivered and their response time was immediate.  I worked with Laila in customer service and the service/assistance she provided was exceptional.  Great chair.  Great company.  Highly recommended.\n",
        "date": "April 30, 2016",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "JNMNR",
        "rating": "5.0",
        "title": "Comfortable Chair!",
        "content": "\nAmazing chair! I have a very, very bad back - I've had 4 fusion surgeries and take pain meds everyday for the pain - and this chair is wonderful! Yes, this chair is quite expensive but it is worth the money. There are so many adjustments and they enable me to set up the chair so that I finally have an office chair that fits (I'm 6' 4\" and supports my back in the right places without any  hot spots.\n",
        "date": "August 22, 2017",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Robert Brady",
        "rating": "5.0",
        "title": "Well worth the money",
        "content": "\nFirst of all, do NOT get expert assembly on this.  Assembly is 4 screws.  It took me about 2 minutes to put it together.I was suffering from really severe shoulder pain as a programmer.  This cured it the day I started using it.  I knew my chair was the wrong height for my desk, and they I switched to this chair I was able to correct it and get the right support from the arm rests.\n",
        "date": "July 10, 2017",
        "verified": true,
        "helpful": "8",
        "image_urls": []
    },
    {
        "author": "Kindle Customer",
        "rating": "4.0",
        "title": "Arrived quickly and in good condition. It did not have the new arm ...",
        "content": "\nArrived quickly and in good condition.  It did not have the new arm adjustment levers, but the older thumb screw model.  Also did not come with an instruction book.  I found something on the internet, but still figuring out the correct adjustments to make it work.\n",
        "date": "April 1, 2016",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    },
    {
        "author": "Surfer Shopper",
        "rating": "5.0",
        "title": "Like New Herman Miller Aeron - nothing more to say",
        "content": "\nIf I didn't buy this chair myself, knowing it is \"used\" I never would have known.  It is in absolutely \"like new\" condition and appearance.  I've had one just like it at my work office, so I knew what to expect and I wasn't disappointed.\n",
        "date": "July 22, 2020",
        "verified": true,
        "helpful": null,
        "image_urls": []
    },
    {
        "author": "Ed",
        "rating": "5.0",
        "title": "The chair has made a great deal of difference in my attitude towards coming to ...",
        "content": "\nI spend the majority of my time in the office sitting at my desk reading and writing procedures. As a result i had developed back trouble. After only two weeks in the Herman Miller chair with the lumbar support i started feeling relief. Its been approx 4 weeks now and at least for the moment i am experiencing no issues with my back. The chair has made a great deal of difference in my attitude towards coming to work.\n",
        "date": "November 17, 2014",
        "verified": true,
        "helpful": "One person found this helpful",
        "image_urls": []
    }
]